Revit 2027 API
FabricationPart.SheetMetalArea Property
 The sheet metal area of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SheetMetalArea { get; }
Public ReadOnly Property SheetMetalArea As Double
	Get
public:
property double SheetMetalArea {
	double get ();
}
member SheetMetalArea : float with get
Property Value
Double
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace